tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "dart-lang/dart"
tap "leoafarias/fvm"

brew "asdf"
brew "awscli"
brew "autojump"
brew "bazelisk"
brew "buildifier"
brew "cmake"
brew "dart"
brew "direnv"
brew "fvm"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "gopls"
brew "gpg"
brew "jenv"
brew "llvm"
brew "mas"
brew "nvim"
brew "nvm"
brew "openjdk@22"
brew "pdm"
brew "pipx"
brew "pyenv"
brew "rbenv"
brew "rustup"
brew "tldr"
brew "tmux"
brew "vim"
brew "watchman"
brew "yarn"
brew "zsh"

cask "adguard"
cask "alfred"
cask "android-studio"
cask "discord"
cask "docker"
cask "figma"
cask "flux"
cask "gitkraken"
cask "goland"
cask "google-chrome"
cask "evkey"
cask "iina"
cask "intellij-idea"
cask "iterm2"
cask "logi-options-plus"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "notion"
cask "oracle-jdk"
cask "postman"
cask "pycharm"
cask "qbittorrent"
cask "setapp"
cask "sf-symbols"
cask "spotify"
cask "surfshark"
cask "visual-studio-code"
cask "zoom"

cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-fontawesome"
cask "font-inconsolata"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"

mas "Apple Configurator 2", id: 1037126344
mas "Apple Developer", id: 640199958
mas "Keynote", id: 409183694
mas "Messenger", id: 1480068668
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
